'''Задача 2: Форматирование текста'''

book = open("./task_2.txt", encoding="utf-8")
text = book.read()
book.close()

print(text)

user_word = input("Введите длину строк в символах:")

#1



